tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "mas-cli/tap"
brew "ack"
brew "readline"
brew "python@3.10"
brew "azure-cli"
brew "bash"
brew "glib"
brew "python@3.11"
brew "cfssl"
brew "clusterctl"
brew "coreutils"
brew "exercism"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "unbound"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "openjdk"
brew "gradle"
brew "grc"
brew "helm"
brew "hugo"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "python@3.9"
brew "python@3.8"
brew "libyaml"
brew "linkerd"
brew "mas"
brew "maven"
brew "neovim"
brew "node"
brew "openjdk@11"
brew "openjdk@17"
brew "ripgrep"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "skaffold"
brew "staticcheck"
brew "step"
brew "stern"
brew "strongswan"
brew "terraform"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
cask "docker"
cask "dotnet-sdk6-0-400"
cask "dropbox", args: { appdir: "/Applications" }
cask "goland", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "lens"
cask "microsoft-edge"
cask "postman"
cask "skype"
cask "spectacle", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
mas "Azure VPN Client", id: 1553936137
mas "HP Smart", id: 1474276998
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
vscode "aksdev.aksdev"
vscode "dan-c-underwood.arm"
vscode "donjayamanne.githistory"
vscode "felixfbecker.php-intellisense"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "Ionide.Ionide-fsharp"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.aks-devx-tools"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "redhat.vscode-yaml"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zobo.php-intellisense"
